{
    "content": "Arunabha Mukhopadhyay\nThird-Year CSE Student |\nAspiring Software Developer and Blockchain Enthusiasts\n+919761444425 | github | linkedin | dkarunabha2006@gmail.com |\nEducation:\nSymbiosis Institute of Technology, Pune 2023 - 2026\nBachelor of Technology in Computer Science Engineering CGPA: 7.32\nDelhi Public School, Roorkee 2023\nClass-12th 78%\nDelhi Public School, Roorkee 2021\nClass -10th 93.3%\nPROjECTS:\nSparkathon By Walmart:\nTech Stack: React.js, Node.js, Express.js, MongoDB, Gemini API, REST API, JWT\n Collaborated with a team of 5 to design and develop a retail platform prototype during Walmart Sparkathon.\n Structured 10+ MongoDB collections for inventory, users, and transactions, improving query handling efficiency.\n Integrated Gemini API to enable AI-powered product recommendations and personalized content.\n Implemented role-based JWT authentication ensuring secure access to platform features.\n Built React.js dashboards for deal discovery, presenting live inventory data in real time during demos.\nBajaj-Hackrx-Hackathon:\nTech Stack: FastAPI, LangChain, Google Gemini 2.5 Pro, Pinecone, Python\n Created an AI-driven backend system to handle 10+ multi-format documents (PDF, DOCX, emails).\n Developed semantic search pipeline with Google Embeddings + Pinecone, establishing a strong baseline for further tuning.\n Enhanced async/await workflows, resulting in 40% reduced query latency on sample repositories.\n Exposed functionality via RESTful APIs with integrated logging and monitoring during hackathon testing.\nWeb-Based-Wallet:\nTech Stack: React.js, Node.js, Express.js, Tailwind CSS, Solana Web3.js, Ethers.js, BIP39\n Engineered a multi-chain wallet system supporting Solana & Ethereum wallet generation via BIP39 mnemonics.\n Built REST APIs for blockchain lookups with sub-500ms response time on test cases.\n Designed a modular React UI with dark mode & wallet interaction features, improving usability.\n Added security-focused features including private key masking & validation, strengthening reliability.\n Fine-tuned API calls and state management, achieving a 35% faster response time during internal testing.\n Delivered utility functions for import/export and error handling, ensuring smooth developer usage.\nTECHNICAL SKILLS:\n Languages: C/C++, JavaScript, SQL\n Frameworks: React.js, Node.js, Express.js, HTML, CSS, Web3.js\n Databases: MongoDB (NoSQL), SQL\n Tools: Git, GitHub, VS Code, Postman, GitHub Actions\n APIs: REST API Development, JWT Authentication, Third-Party API Integration\n Core CS: OOP, Testing, Debugging, DBMS\nSoft Skills: Resilient, curious, and flexible, strategic thinking persistence, growth mindset, and full ownership\nACHIEVEMENTS & PARTICIPATION:\n Hackathons: Walmart Sparkathon (Full-stack retail platform), Bajaj HackRx (AI document Q&A), Reimagine Hackathon (advanced\nto Round 2), SIH Hackathon ( Blockchain based carbon token and MRV System.)\n Recognition: Built & deployed Vaishnav-Memorial on Vercel; Demonstrated expertise in scalable web apps & DB management; Strong\nexperience in API integration & modern web tech."
}